mock-example/src/main/resources/in/KKMB/ESB/ECH/ECHRequst&Response.xml

<?xml version="1.0" encoding="UTF-8"?>
<tns:Envelope 
	xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ KKMBMessageElements.xsd" 
	xmlns:ech="http://sbrf.ru/prpc/ech/10" 
	xmlns:hdr="http://sbrf.ru/prpc/mq/headers" 
	xmlns:tns="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:chs="http://www.sbrf.ru/CreditHistoryScoring" 
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<tns:Header>
		<hdr:AsyncHeader>
			<hdr:message-id>AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA</hdr:message-id>
			<hdr:request-time>2001-12-17T09:30:47Z</hdr:request-time>
			<hdr:correlation-id>AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA</hdr:correlation-id>
			<hdr:eis-name>test text</hdr:eis-name>
			<hdr:system-id>test text</hdr:system-id>
			<hdr:operation-name>test text</hdr:operation-name>
			<hdr:operation-version>test text</hdr:operation-version>
			<hdr:user-id>test text</hdr:user-id>
			<hdr:user-name>test text</hdr:user-name>
		</hdr:AsyncHeader>
	</tns:Header>
	<tns:Body>
		<ech:SrvGetCreditHistoryScoringRq>
			<chs:checkInternal>true</chs:checkInternal>
			<chs:checkExternal>true</chs:checkExternal>
			<chs:participants>
				<chs:participant>
					<chs:index>0</chs:index>
					<chs:role>2</chs:role>
					<chs:status>4</chs:status>
					<chs:naturalPerson>
						<chs:INN>aaaaaaaaaaaa</chs:INN>
						<chs:gender>2</chs:gender>
						<chs:resident>1</chs:resident>
						<chs:birthPlace>test text</chs:birthPlace>
						<chs:currentPersonData>
							<chs:firstName>xxxxxxxxxxxxxxxxxxxxxxxxx</chs:firstName>
							<chs:lastName>xxxxxxxxxxxxxxxxxxxxxxxxx</chs:lastName>
							<chs:middleName>xxxxxxxxxxxxxxxxxxxxxxxxx</chs:middleName>
							<chs:birthDate>1967-08-13</chs:birthDate>
						</chs:currentPersonData>
						<chs:previousPersonData>
							<chs:firstName>xxxxxxxxxxxxxxxxxxxxxxxxx</chs:firstName>
							<chs:lastName>xxxxxxxxxxxxxxxxxxxxxxxxx</chs:lastName>
							<chs:middleName>xxxxxxxxxxxxxxxxxxxxxxxxx</chs:middleName>
							<chs:birthDate>1967-08-13</chs:birthDate>
						</chs:previousPersonData>
						<chs:primaryID>
							<chs:idType>02</chs:idType>
							<chs:serie>aaaaaaaaaaaaaaaaaaaa</chs:serie>
							<chs:number>aaaaaaaaaaaaaaaaaaaa</chs:number>
							<chs:issueLocation>test text</chs:issueLocation>
							<chs:issueDate>1967-08-13</chs:issueDate>
							<chs:issueAuthority>test text</chs:issueAuthority>
							<chs:foreignSeriesAndNumber>aaaaaaaaaaaaaaaaaaaa</chs:foreignSeriesAndNumber>
						</chs:primaryID>
						<chs:actualAddress>
							<chs:city>xxxxxxxxxxxxxxxxxxxxxxxxxaaaaaaaaaa</chs:city>
							<chs:street>xxxxxxxxxxxxxxxxxxxxxxxxxaaaaaaaaaa</chs:street>
							<chs:blockNumber>aaaaaaaaaaaaaaaaaaaa</chs:blockNumber>
						</chs:actualAddress>
						<chs:registrationAddress>
							<chs:city>xxxxxxxxxxxxxxxxxxxxxxxxxaaaaaaaaaa</chs:city>
							<chs:street>xxxxxxxxxxxxxxxxxxxxxxxxxaaaaaaaaaa</chs:street>
							<chs:blockNumber>aaaaaaaaaaaaaaaaaaaa</chs:blockNumber>
						</chs:registrationAddress>
					</chs:naturalPerson>
				</chs:participant>
			</chs:participants>
		</ech:SrvGetCreditHistoryScoringRq>
		<ech:SrvGetCreditHistoryScoringRs>
			<chs:dealResult>
				<chs:systemErrors>
					<chs:error>
						<chs:code>String</chs:code>
						<chs:message>String</chs:message>
						<chs:cause>String</chs:cause>
					</chs:error>
				</chs:systemErrors>
				<chs:dealScoringResult>
					<chs:sid>String</chs:sid>
					<chs:name>String</chs:name>
					<chs:value>String</chs:value>
				</chs:dealScoringResult>
				<chs:status>ERROR</chs:status>
				<chs:strategyCodes>String</chs:strategyCodes>
				<chs:comments>String</chs:comments>
			</chs:dealResult>
			<chs:participantResults>
				<chs:participantResult>
					<chs:participantIndex>0</chs:participantIndex>
					<chs:status>ERROR</chs:status>
					<chs:participantScoringResult>
						<chs:internalScoringGrade>String</chs:internalScoringGrade>
						<chs:externalScoringGrade>String</chs:externalScoringGrade>
						<chs:unifiedScoringGrade>String</chs:unifiedScoringGrade>
						<chs:strategyCodes>String</chs:strategyCodes>
						<chs:comments>String</chs:comments>
					</chs:participantScoringResult>
					<chs:histories>
						<chs:creditHistory>
							<chs:sourceCB>GP</chs:sourceCB>
							<chs:BankSign>String</chs:BankSign>
							<chs:nRelationshipDuration>0</chs:nRelationshipDuration>
							<chs:lastRecordUpdate>1967-08-13</chs:lastRecordUpdate>
							<chs:liabilityStatus>0</chs:liabilityStatus>
							<chs:liabilityType>20</chs:liabilityType>
							<chs:baseLiabilityType>01</chs:baseLiabilityType>
							<chs:amountInitial>0.0</chs:amountInitial>
							<chs:interestRate>0.0</chs:interestRate>
							<chs:residualDebt>0.0</chs:residualDebt>
							<chs:liabilityCurrency>String</chs:liabilityCurrency>
							<chs:liabilityNo>String</chs:liabilityNo>
							<chs:dateStart>1967-08-13</chs:dateStart>
							<chs:dateRedemptionScheduled>1967-08-13</chs:dateRedemptionScheduled>
							<chs:dateRedemptionActual>1967-08-13</chs:dateRedemptionActual>
							<chs:repaymentMethod>0</chs:repaymentMethod>
							<chs:currentArrearAmount>0.0</chs:currentArrearAmount>
							<chs:isRestructured>0</chs:isRestructured>
							<chs:cred_sum_limit>0.0</chs:cred_sum_limit>
							<chs:cred_prolong>0</chs:cred_prolong>
							<chs:kodTb>String</chs:kodTb>
							<chs:nameTb>String</chs:nameTb>
							<chs:liabilityArrearsBlockCount>0</chs:liabilityArrearsBlockCount>
							<chs:blockDataASSD>
								<chs:_dcas_ResidualDebtAndArrear>0.0</chs:_dcas_ResidualDebtAndArrear>
								<chs:productType>String</chs:productType>
								<chs:productCode>String</chs:productCode>
								<chs:subProductCode>String</chs:subProductCode>
							</chs:blockDataASSD>
							<chs:liabilityArrearsBlock>
								<chs:yearNumber>String</chs:yearNumber>
								<chs:DtYearBegin>1967-08-13</chs:DtYearBegin>
								<chs:DtYearEnd>1967-08-13</chs:DtYearEnd>
								<chs:arrearsCount_1_5>0.0</chs:arrearsCount_1_5>
								<chs:arrearsCount_6_30>0.0</chs:arrearsCount_6_30>
								<chs:arrearsCount_1_30>0.0</chs:arrearsCount_1_30>
								<chs:arrearsCount_31_60>0.0</chs:arrearsCount_31_60>
								<chs:arrearsCount_61_90>0.0</chs:arrearsCount_61_90>
								<chs:arrearsCount_91_120>0.0</chs:arrearsCount_91_120>
								<chs:arrearsCount_121_150>0.0</chs:arrearsCount_121_150>
								<chs:arrearsCount_151_180>0.0</chs:arrearsCount_151_180>
								<chs:arrearsCount_180>0.0</chs:arrearsCount_180>
								<chs:nMaxDelayPayments>0</chs:nMaxDelayPayments>
								<chs:arrearsCount_PerYear>0</chs:arrearsCount_PerYear>
							</chs:liabilityArrearsBlock>
						</chs:creditHistory>
					</chs:histories>
				</chs:participantResult>
			</chs:participantResults>
		</ech:SrvGetCreditHistoryScoringRs>
	</tns:Body>
</tns:Envelope>
